Autodesk.Revit.UI.TextBoxData.Image
The image of the TextBox.
Remarks: The image will be shown on the left side of the item.
The best size is 16 x 16 pixels.
Since: 2011

Autodesk.Revit.UI.TextBoxData.#ctor(System.String)
Constructs a new instance of TextBoxData.
name: The internal name of the TextBoxData.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when null is passed for name.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an empty string is passed for name.
Since: 2011

Autodesk.Revit.UI.TextBoxData
This class contains information necessary to construct a text box in the Ribbon.
Since: 2011